---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits
source: html/7559f1e1-a53b-3350-e1b8-56664d7ce6c7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits Property

The feed through lugs is occupied, so other circuits connected with feed through lugs will be disconnected from this panel [Panel Name].

## Syntax (C#)
```csharp
public static FailureDefinitionId FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits { get; }
```